Repository: tspzar/rtmpdump
Catalog: i18n/*.po
Languages: de

source: %s: This program dumps the media content streamed over RTMP.
de: %s: Dieses Programm speichert Medieninhalte, die über das RTMP-Protokoll gesendet werden

source: %.3f kB / %.2f sec
de: %.3f kB / %.2f Sek.

source: %.3f kB / %.2f sec (%.1f%%)
de: %.3f kB / %.2f Sek. (%.1f%%)

source: %s download at: %.3f kB
de: %s Download bei: %.3f kB

source: %s download at: %.3f kB / %.3f sec (%.1f%%)
de: %s Download bei: %.3f kB / %.3f Sek. (%.1f%%)

source: %s, error decoding meta data packet
de: %s, Fehler beim Dekodieren des Metadatenpakets

source: %s: Failed writing, exiting!
de: %s: Schreibvorgang fehlgeschlagen! Programm wird beendet...

source: (c) 2010 Andrej Stepanchuk, Howard Chu, The Flvstreamer Team; license: GPL
de: (c) 2010 Andrej Stepanchuk, Howard Chu, das Flvstreamer-Team; Lizenz: GPL

source: --app|-a app Name of target app on server
de: --app|-a <App> Name der Ziel-App auf dem Flash-Server

source: --auth|-u string Authentication string to be appended to the connect string
de: --auth|-u <Zeichenkette> Die der connect-Zeichenkette anzufügende Authentifizierungszeichenkette

source: --buffer|-b Buffer time in milliseconds (default: %u)
de: --buffer|-b Bufferzeit in Millisekunden (Standard: %u)

source: --conn|-C type:data Arbitrary AMF data to be appended to the connect string
de: --conn|-C <Typ>:<Daten> Die der connect-Zeichenkette anzufügenden AMF-Daten

source: --debug|-z Debug level command output.
de: --debug|-z Debuginformationen ausgeben

source: --flashVer|-f string Flash version string (default: "%s")
de: --flashVer|-f <Zeichenk.> Flash-Player-Version (Standard: "%s")

source: --flv|-o string FLV output file name, if the file name is - print stream to stdout
de: --flv|-o <Zeichenkette> Name der FLV-Ausgabedatei (Standardausgabe, wenn - angegeben wird) "

source: --hashes|-# Display progress with hashes, not with the byte counter
de: --hashes|-# Fortschritt mit Doppelkreuz statt Bytezähler visualisieren

source: --help|-h Prints this help screen.
de: --help|-h Diese Hilfeseite ausgeben.

source: --host|-n hostname Overrides the hostname in the rtmp url
de: --host|-n <Hostnamen> Überschreibt den Hostnamen in der RTMP-URL

source: --jtv|-j JSON Authentication token for Justin.tv legacy servers
de: --jtv|-j <JSON> Authentifizierungstoken für Justin.tv-Servers

source: --live|-v Save a live stream, no --resume (seeking) of live streams possible
de: --live|-v Livestream speichern (Springen/Fortsetzen nicht möglich)ņ

source: --pageUrl|-p url Web URL of played programme
de: --pageUrl|-p <URL> Web-URL des abzuspielenden Streams

source: --playlist|-Y Set playlist before playing
de: --playlist|-Y Playlist vor Spielen setzen

source: --playpath|-y path Overrides the playpath parsed from rtmp url
de: --playpath|-y <Pfad> Überschreibt den aus der RTMP-URL ausgelesenen Playpath

source: --port|-c port Overrides the port in the rtmp url
de: --port|-c <Port> Überschreibt den aus der RTMP-URL ausgelesenen Port

source: --protocol|-l num Overrides the protocol in the rtmp url (0 - RTMP, 2 - RTMPE)
de: --protocol|-l <Zahl> Überschreibt das aus der RTMP-URL ausgelesene Protokoll (0 - RTMP, 2 - RTMPE)

source: --quiet|-q Suppresses all command output.
de: --quiet|-q Alle Ausgaben unterdrücken

source: --realtime|-R Don't attempt to speed up download via the Pause/Unpause BUFX hack
de: --realtime|-R Downloadbeschleunigung via Pause/Unpause-BUFX-Hack deaktivieren

source: --resume|-e Resume a partial RTMP download
de: --resume|-e Unvollständigen RTMP-Download fortsetzen

source: --rtmp|-r url URL (e.g. rtmp://host[:port]/path)
de: --rtmp|-r <URL> URL (z.B. rtmp://Host[:Port]/Path)

source: --skip|-k num Skip num keyframes when looking for last keyframe to resume from. Useful if resume fails (default: %d)
de: --skip|-k Zahl <Zahl> Schlüsselbilder bei der Suche nach dem letzten Schlüsselbild, von dem fortgesetzt werden kann, überspringen. Nützlich wenn das normale Fortsetzen fehlschlägt (Standard: %d)

source: --socks|-S host:port Use the specified SOCKS proxy
de: --socks|-S Host:Port SOCKS-Proxy benutzen

source: --start|-A num Start at num seconds into stream (not valid when using --live)
de: --start|-A <Zahl> Bei <Zahl> Sekunden im Stream starten (funktioniert nicht mit --live)

source: --stop|-B num Stop at num seconds into stream
de: --stop|-B <Zahl> Bei <Zahl> Sekunden im Stream anhalten

source: --subscribe|-d string Stream name to subscribe to (otherwise defaults to playpath if live is specifed)
de: --subscribe|-d <Zeichenk.> Name des einzuschreibenden Stream (ansonsten wird bei Livestreams der Playpath verwendet)

source: --swfAge|-X days Number of days to use cached SWF hash before refreshing
de: --swfAge|-X <Tage> Nach <Tagen> den zwischengespeicherten SWF-Hash aktualisieren

source: --swfUrl|-s url URL to player swf file
de: --swfUrl|-s <URL> URL der SWF-Datei

source: --swfVfy|-W url URL to player swf file, compute hash/size automatically
de: --swfVfy|-W <URL> URL der SWF-Datei, von dieser automatisch Größe und Prüfsumme errechnen

source: --swfhash|-w hexstring SHA256 hash of the decompressed SWF file (32 bytes)
de: --swfhash|-w hexstring SHA256-Prüfsumme der dekomprimierten SWF-Datei (32 Bytes). Für SWF-Verifzierung benötigt.

source: --swfsize|-x num Size of the decompressed SWF file, required for SWFVerification
de: --swfsize|-x <ZAHL> Größe der dekomprimierten SWF-Datei. Für SWF-Verifizierung benötigt.

source: --tcUrl|-t url URL to played stream (default: "rtmp://host[:port]/app")
de: --tcUrl|-t <URL> URL des zu spielenden Streams (Standard: "rtmp://Host[:Port]/App")

source: --timeout|-m num Timeout connection num seconds (default: %u)
de: --timeout|-m <Zahl> Zeitüberschreitung nach <Zahl> Sekunden (Standard: %u)

source: --token|-T key Key for SecureToken response
de: --token|-T <Schlüssel> Schlüssel für SecureToken-Antwort

source: --url|-i url URL with options included (e.g. rtmp://host[:port]/path swfUrl=url tcUrl=url)
de: --url|-i url URL inklusive Optionen (z.B. rtmp://Host[:Port]/Pfad swfUrl=<URL> tcUrl=<URL>

source: --verbose|-V Verbose command output.
de: --verbose|-V Ausführliche Informationen ausgeben

source: Already Completed
de: Bereits vollständig

source: Already Completed at: %.3f sec Duration=%.3f sec
de: Bereits heruntergeladen bis: %.3f Sek. Dauer=%.3f Sek.

source: Buffer time must be greater than zero, ignoring the specified value %d!
de: Bufferzeit muss größer als null sein. Angegebener Wert %d ignoriert

source: Can't resume in stdout mode, ignoring --resume option
de: Fortsetzen von Streams bei Schreiben auf die Standardaufgabe nicht möglich! Option --resume ignoriert

source: Can't resume live stream, ignoring --resume option
de: Livestream kann nicht fortgesetzt werden! Option --resume ignoriert

source: Can't seek a resumed stream, ignoring --start option
de: In einem fortgesetzten Stream kann nicht zu einem Zeitpunkt gesprungen werden! Option --start ignoriert

source: Can't seek in a live stream, ignoring --start option
de: In einem Livestream kann nicht zu einem Zeitpunkt gesprungen werden! Option --start ignoriert

source: Caught signal: %d, cleaning up, just a second...
de: Empfangenes Signal: %d. Programm wird ordnungsgemäß beendet, bitte warten...

source: Closing connection.
de: Verbindung wird geschlossen...

source: Connected...
de: Verbunden...

source: Connecting ...
de: Verbindung wird aufgebaut ...

source: Connection timed out, trying to resume.
de: Zeitüberschreitung beim Verbindungsaufbau. Versuch zur Fortsetzung wird gestartet...

source: Continuing at TS: %d ms
de: Fortsetzung bei %d ms

source: Couldn't find keyframe to resume from!
de: Es konnte kein Schlüsselbild zur Fortsetzung gefunden werden!

source: Couldn't load sockets support on your platform, exiting!
de: Auf ihrer Plattform gibt es keine Unterstützung für Sockets! Das Programm wird beendet...

source: Couldn't parse URL: %s
de: Die URL %s konnte nicht ausgelesen werden

source: Couldn't parse the specified url (%s)!
de: Die angegebene URL (%d) konnte nicht ausgelesen werden!

source: Couldn't read FLV file header!
de: Der Kopf der FLV-Datei konnte nicht gelesen werden!

source: Couldn't read header!
de: Kopf konnte nicht gelesen werden!

source: Couldn't read last keyframe, aborting!
de: Letztes Schlüsselbild konnte nicht gelesen werden. Download wird abgebrochen...

source: Couldn't read prevTagSize from file!
de: prevTagSize konnte in der Datei nicht gelesen werden!

source: Couldn't resume FLV file, try --skip %d
de: FLV-Datei kann nicht fortgesetzt werden. Versuchen Sie es bitte erneut mit --skip %d

source: Detected that buffer time is less than duration, resetting to: %dms
de: Bufferzeit ist kleiner als Dauer. Zurücksetzung auf %d ms.

source: Download complete
de: Download erfolgreich abgeschlossen

source: Download may be incomplete (downloaded about %.2f%%), try resuming
de: Download dürfte unvollständig sein (heruntergeladen bis %.2f%%). Fortsetzung wird versucht....

source: FLV file contains neither video nor audio, aborting!
de: FLV-Datei enthält weder Video- noch Audiospur! Programm wird beendet...

source: Failed to get last keyframe.
de: Das letzte Schlüsselbild konnte nicht gefunden werden.

source: Failed to open file! %s
de: Die Datei konnte nicht geöffnet werden! %s

source: Failed to resume the stream
de: Der Stream konnte nicht fortgesetzt werden

source: First prevTagSize is not zero: prevTagSize = 0x%08X
de: Erstes prevTagSize ist nicht null: prevTagSize = 0x%08X

source: For duration: %.3f sec
de: Für die Dauer: %.3f Sek.

source: Ignoring SWF hash, supply also the swf size with --swfsize
de: SWF-Hash und angegebene SWF-Größe wird ignoriert

source: Ignoring SWF size, supply also the hash with --swfhash
de: SWF-Größe und angegebener SWF-Hash wird ignoriert

source: Invalid AMF parameter: %s
de: Ungültiger AMF-Parameter: %s

source: Invalid FLV file!
de: Ungültige FLV-Datei!

source: Invalid FLV file: missing first prevTagSize!
de: Ungültige FLV-Datei: erster "prevTagSize" fehlt!

source: Last keyframe found at: %d ms, size: %d, type: %02X
de: Letztes Schlüsselbild gefunden bei: %d ms, Größe: %d, Typ: %02X

source: Last keyframe is first frame in stream, switching from resume to normal mode!
de: Letztes Schlüsselbild ist erster Frame im Stream. Aus dem Fortsetzungs- in den Normalmodus umschalten...

source: Last keyframe timestamp is negative, aborting, your file is corrupt!
de: Zeitstempel des letzten Schlüsselbilds ist negativ. Der Stream wird abgebrochen, weil die Datei korrupt ist.

source: Number of keyframes skipped must be greater or equal zero, using zero!
de: Anzahl der übersprungenen Schlüsselbild muss größer/gleich null sein! 0 wird verwendet

source: Number of skipped key frames for resume: %d
de: Es wurden %d Schlüsselbilder zwecks Streamfortsetzung übersprungen

source: RTMP_Read returned: %d
de: RTMP_Read gab %d aus

source: Resuming
de: Stream wird fortgesetzt....

source: SWF Age must be non-negative, ignoring
de: Ihre SWF-Datei scheint aus der Zukunft zu kommen. Ignorieren...

source: SWF Size must be at least 1, ignoring
de: SWF-Größe muss mindestens 1 betragen. Ignorieren...

source: Setting buffer time to: %dms
de: Bufferzeit wird auf %d ms gesetzt

source: Starting
de: Stream wird gestartet...

source: Starting Live Stream
de: Livestream wird gestartet...

source: Unexpected start of file, error in tag sizes, couldn't arrive at prevTagSize=0
de: Unerwarteter Dateibeginn, Fehler in den Tag-Größen, prevTagSize=0 konnte nicht erreicht werden

source: Unknown protocol specified: %d
de: Unbekanntes Protokoll %d angegeben

source: You haven't specified a port (--port) or rtmp url (-r), using default port 1935
de: Sie haben weder einen Port (--port) noch eine RTMP-URL (-r) angegeben. Standardport 1935 wird benutzt...

source: You haven't specified a protocol (--protocol) or rtmp url (-r), using default protocol RTMP
de: Sie haben weder ein Protokoll (--protocol) noch eine RTMP-Url (-r) angegeben. Standardprotokoll RTMP wird benutzt...

source: You haven't specified an output file (-o filename), using stdout
de: Sie haben keine Ausgabe-/Zieldatei (-o Dateiname) angegeben. Standardausgabe wird benutzt...

source: You must specify a hostname (--host) or url (-r "rtmp://host[:port]/playpath") containing a hostname
de: Sie müssen einen Hostnamen (--host) oder eine URL inklusive Hostnamen (-r "rtmp://Host[:Port]/Playpath") angeben

source: You must specify a playpath (--playpath) or url (-r "rtmp://host[:port]/playpath") containing a playpath
de: Sie müssen einen Playpath (--playpath) oder eine URL inklusive Playpath (-r "rtmp://Host[:Port]/Playpath") angeben.

source: bAudioOnly: %d, size: %llu
de: bAudioOnly: %d, Größe: %llu

source: packet.
de: Paket.

source: unknown option: %c
de: Unbekannte Option: %c

source: xxxxxxxxxxxxxxxxxxxxxxxx Well, lets go one more back!
de: xxxxxxxxxxxxxxxxxxxxxxxx Na ja, dann lasst uns eins weiter zurückgehen!

source: zero read!
de: Null gelesen
